2016/brp 2016-02-09/test/testcases/legacy/src/main/resources/testcases/art_input_MutatieleveringOpDoelbinding/data/EIOuderInDoelbinding-TC02-1-dataresponse.xml

<Results>
    <ResultSet fetchSize="0">
          <Row rowNumber="1">
            <ABONNEMENT>5670020</ABONNEMENT>
            <NAAM>Mutaties op personen van wie u de bijhoudingspartij heeft id 25003</NAAM>
            <DATA><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <brp:lvg_synVerwerkPersoon xmlns:brp="http://www.bzk.nl/brp/brp0200">
  <brp:stuurgegevens>
    <brp:zendendePartij>199903</brp:zendendePartij>
    <brp:zendendeSysteem>BRP</brp:zendendeSysteem>
    <brp:ontvangendePartij>505003</brp:ontvangendePartij>
    <brp:ontvangendeSysteem>Leveringsysteem</brp:ontvangendeSysteem>
    <brp:referentienummer>*</brp:referentienummer>
    <brp:tijdstipVerzending>*</brp:tijdstipVerzending>
  </brp:stuurgegevens>
  <brp:parameters>
    <brp:soortSynchronisatie>Volledigbericht</brp:soortSynchronisatie>
    <brp:abonnementNaam>Mutaties op personen van wie u de bijhoudingspartij heeft id 25003</brp:abonnementNaam>
    <brp:categorieDienst>Mutatielevering op basis van doelbinding</brp:categorieDienst>
  </brp:parameters>
  <brp:synchronisatie brp:objecttype="AdministratieveHandeling">
    <brp:code>01001</brp:code>
    <brp:naam>Geboorte in Nederland</brp:naam>
    <brp:categorie>Actualisering</brp:categorie>
    <brp:partijCode>505003</brp:partijCode>
    <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
    <brp:bijgehoudenPersonen>
      <brp:persoon brp:objecttype="Persoon" brp:communicatieID="1">
        <brp:soortCode>I</brp:soortCode>
        <brp:afgeleidAdministratief brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>*</brp:actieInhoud>
          <brp:tijdstipLaatsteWijziging>*</brp:tijdstipLaatsteWijziging>

          <brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>N</brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>
        </brp:afgeleidAdministratief>
        <brp:identificatienummers brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>*</brp:actieInhoud>
          <brp:datumAanvangGeldigheid>${vandaag()}</brp:datumAanvangGeldigheid>
          <brp:burgerservicenummer>809468852</brp:burgerservicenummer>
          <brp:administratienummer>1010103835</brp:administratienummer>
        </brp:identificatienummers>
        <brp:samengesteldeNaam brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>*</brp:actieInhoud>
          <brp:datumAanvangGeldigheid>${vandaag()}</brp:datumAanvangGeldigheid>
          <brp:indicatieNamenreeks>N</brp:indicatieNamenreeks>
          <brp:voornamen>XYZ</brp:voornamen>
          <brp:geslachtsnaamstam>Vlag</brp:geslachtsnaamstam>
        </brp:samengesteldeNaam>
        <brp:geboorte brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>*</brp:actieInhoud>
          <brp:datum>${vandaag()}</brp:datum>
          <brp:gemeenteCode>1773</brp:gemeenteCode>
          <brp:landGebiedCode>6030</brp:landGebiedCode>
        </brp:geboorte>
        <brp:geslachtsaanduiding brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>*</brp:actieInhoud>
          <brp:datumAanvangGeldigheid>${vandaag()}</brp:datumAanvangGeldigheid>
          <brp:code>M</brp:code>
        </brp:geslachtsaanduiding>
        <brp:inschrijving brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>*</brp:actieInhoud>
          <brp:datum>${vandaag()}</brp:datum>
        </brp:inschrijving>
        <brp:bijhouding brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>*</brp:actieInhoud>
          <brp:datumAanvangGeldigheid>${vandaag()}</brp:datumAanvangGeldigheid>
          <brp:partijCode>505003</brp:partijCode>
          <brp:bijhoudingsaardCode>I</brp:bijhoudingsaardCode>
          <brp:nadereBijhoudingsaardCode>A</brp:nadereBijhoudingsaardCode>
          <brp:indicatieOnverwerktDocumentAanwezig>N</brp:indicatieOnverwerktDocumentAanwezig>
        </brp:bijhouding>
        <brp:voornamen>
          <brp:voornaam brp:objecttype="PersoonVoornaam" brp:voorkomenSleutel="*" brp:objectSleutel="*">
            <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
            <brp:actieInhoud>*</brp:actieInhoud>
            <brp:datumAanvangGeldigheid>${vandaag()}</brp:datumAanvangGeldigheid>
            <brp:volgnummer>1</brp:volgnummer>
            <brp:naam>XYZ</brp:naam>
          </brp:voornaam>
        </brp:voornamen>
        <brp:geslachtsnaamcomponenten>
          <brp:geslachtsnaamcomponent brp:objecttype="PersoonGeslachtsnaamcomponent" brp:voorkomenSleutel="*" brp:objectSleutel="*">
            <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
            <brp:actieInhoud>*</brp:actieInhoud>
            <brp:datumAanvangGeldigheid>${vandaag()}</brp:datumAanvangGeldigheid>
            <brp:volgnummer>1</brp:volgnummer>
            <brp:stam>Vlag</brp:stam>
          </brp:geslachtsnaamcomponent>
        </brp:geslachtsnaamcomponenten>
        <brp:naamgebruik brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>*</brp:actieInhoud>
          <brp:code>E</brp:code>
          <brp:voornamen>XYZ</brp:voornamen>
          <brp:geslachtsnaamstam>Vlag</brp:geslachtsnaamstam>
        </brp:naamgebruik>
        <brp:adressen>
          <brp:adres brp:objecttype="PersoonAdres" brp:voorkomenSleutel="*" brp:objectSleutel="*">
            <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
            <brp:actieInhoud>*</brp:actieInhoud>
            <brp:datumAanvangGeldigheid>${vandaag()}</brp:datumAanvangGeldigheid>
            <brp:soortCode>W</brp:soortCode>
            <brp:redenWijzigingCode>A</brp:redenWijzigingCode>
            <brp:datumAanvangAdreshouding>${vandaag()}</brp:datumAanvangAdreshouding>
            <brp:identificatiecodeAdresseerbaarObject>1234567890123450</brp:identificatiecodeAdresseerbaarObject>
            <brp:identificatiecodeNummeraanduiding>6030185910431230</brp:identificatiecodeNummeraanduiding>
            <brp:gemeenteCode>5103</brp:gemeenteCode>
            <brp:naamOpenbareRuimte>Plein</brp:naamOpenbareRuimte>
            <brp:afgekorteNaamOpenbareRuimte>P</brp:afgekorteNaamOpenbareRuimte>
            <brp:gemeentedeel>schilderswijk</brp:gemeentedeel>
            <brp:huisnummer>1</brp:huisnummer>
            <brp:postcode>2000AA</brp:postcode>
            <brp:woonplaatsnaam>SRPUC50151-3-Woonplaats</brp:woonplaatsnaam>
            <brp:landGebiedCode>6030</brp:landGebiedCode>
          </brp:adres>
        </brp:adressen>
        <brp:nationaliteiten>
          <brp:nationaliteit brp:objecttype="PersoonNationaliteit" brp:voorkomenSleutel="*" brp:objectSleutel="*">
            <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
            <brp:actieInhoud>*</brp:actieInhoud>
            <brp:datumAanvangGeldigheid>${vandaag()}</brp:datumAanvangGeldigheid>
            <brp:nationaliteitCode>0001</brp:nationaliteitCode>
            <brp:redenVerkrijgingCode>018</brp:redenVerkrijgingCode>
          </brp:nationaliteit>
        </brp:nationaliteiten>
        <brp:betrokkenheden>
          <brp:kind brp:objecttype="Betrokkenheid" brp:voorkomenSleutel="*" brp:objectSleutel="*">
            <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
            <brp:actieInhoud>*</brp:actieInhoud>
            <brp:familierechtelijkeBetrekking brp:objecttype="Relatie" brp:objectSleutel="*">
              <brp:relatie brp:voorkomenSleutel="*">*</brp:relatie>
              <brp:betrokkenheden>
                <brp:ouder brp:objecttype="Betrokkenheid" brp:voorkomenSleutel="*" brp:objectSleutel="*">
                  <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
                  <brp:actieInhoud>*</brp:actieInhoud>
                  <brp:persoon brp:objecttype="Persoon">
                    <brp:soortCode>I</brp:soortCode>
                    <brp:identificatienummers brp:voorkomenSleutel="*">
                      <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
                      <brp:datumAanvangGeldigheid>1981-10-02</brp:datumAanvangGeldigheid>
                      <brp:burgerservicenummer>800074658</brp:burgerservicenummer>
                      <brp:administratienummer>8080589506</brp:administratienummer>
                    </brp:identificatienummers>
                    <brp:samengesteldeNaam brp:voorkomenSleutel="*">
                      <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
                      <brp:datumAanvangGeldigheid>1981-10-02</brp:datumAanvangGeldigheid>
                      <brp:indicatieNamenreeks>N</brp:indicatieNamenreeks>
                      <brp:voornamen>Cees</brp:voornamen>
                      <brp:geslachtsnaamstam>Vlag</brp:geslachtsnaamstam>
                    </brp:samengesteldeNaam>
                    <brp:geboorte brp:voorkomenSleutel="*">
                      <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
                      <brp:datum>1981-10-02</brp:datum>
                      <brp:gemeenteCode>0519</brp:gemeenteCode>
                      <brp:woonplaatsnaam>Honselersdijk</brp:woonplaatsnaam>
                      <brp:omschrijvingLocatie>omschrijving geboorte locatie Cees</brp:omschrijvingLocatie>
                      <brp:landGebiedCode>6030</brp:landGebiedCode>
                    </brp:geboorte>
                    <brp:geslachtsaanduiding brp:voorkomenSleutel="*">
                      <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
                      <brp:datumAanvangGeldigheid>1981-10-02</brp:datumAanvangGeldigheid>
                      <brp:code>M</brp:code>
                    </brp:geslachtsaanduiding>
                  </brp:persoon>
                  <brp:ouderschap brp:voorkomenSleutel="*">
                    <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
                    <brp:actieInhoud>*</brp:actieInhoud>
                    <brp:datumAanvangGeldigheid>${vandaag()}</brp:datumAanvangGeldigheid>
                  </brp:ouderschap>
                </brp:ouder>
                <brp:ouder brp:objecttype="Betrokkenheid" brp:voorkomenSleutel="*" brp:objectSleutel="*">
                  <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
                  <brp:actieInhoud>*</brp:actieInhoud>
                  <brp:persoon brp:objecttype="Persoon">
                    <brp:soortCode>I</brp:soortCode>
                    <brp:identificatienummers brp:voorkomenSleutel="*">
                      <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
                      <brp:datumAanvangGeldigheid>1982-05-28</brp:datumAanvangGeldigheid>
                      <brp:burgerservicenummer>800011375</brp:burgerservicenummer>
                      <brp:administratienummer>8080752068</brp:administratienummer>
                    </brp:identificatienummers>
                    <brp:samengesteldeNaam brp:voorkomenSleutel="*">
                      <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
                      <brp:datumAanvangGeldigheid>1982-05-28</brp:datumAanvangGeldigheid>
                      <brp:indicatieNamenreeks>N</brp:indicatieNamenreeks>
                      <brp:voornamen>Paula</brp:voornamen>
                      <brp:voorvoegsel>de</brp:voorvoegsel>
                      <brp:scheidingsteken> </brp:scheidingsteken>
                      <brp:geslachtsnaamstam>Prins</brp:geslachtsnaamstam>
                    </brp:samengesteldeNaam>
                    <brp:geboorte brp:voorkomenSleutel="*">
                      <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
                      <brp:datum>1982-05-28</brp:datum>
                      <brp:gemeenteCode>0519</brp:gemeenteCode>
                      <brp:woonplaatsnaam>Honselersdijk</brp:woonplaatsnaam>
                      <brp:landGebiedCode>6030</brp:landGebiedCode>
                    </brp:geboorte>
                    <brp:geslachtsaanduiding brp:voorkomenSleutel="*">
                      <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
                      <brp:datumAanvangGeldigheid>1982-05-28</brp:datumAanvangGeldigheid>
                      <brp:code>V</brp:code>
                    </brp:geslachtsaanduiding>
                  </brp:persoon>
                  <brp:ouderschap brp:voorkomenSleutel="*">
                    <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
                    <brp:actieInhoud>*</brp:actieInhoud>
                    <brp:datumAanvangGeldigheid>${vandaag()}</brp:datumAanvangGeldigheid>
                  </brp:ouderschap>
                </brp:ouder>
              </brp:betrokkenheden>
            </brp:familierechtelijkeBetrekking>
          </brp:kind>
        </brp:betrokkenheden>
        <brp:administratieveHandelingen>*</brp:administratieveHandelingen>
      </brp:persoon>
    </brp:bijgehoudenPersonen>
  </brp:synchronisatie>
</brp:lvg_synVerwerkPersoon>
  </soap:Body>
</soap:Envelope></DATA>
        </Row>
    </ResultSet>
</Results>